{
  "posts": [
    {
      "id": 1,
      "title": "json-server",
      "author": "typicode"
    }
  ],
  "RegistroUsuarios": [
    {
      "fullname": "maria gonzalez",
      "email": "maria@gmail.com",
      "username": "maria2020",
      "password": "12345",
      "id": 1
    },
    {
      "fullname": "hector rodriguez",
      "email": "hector@gmail.com",
      "username": "hector2020",
      "password": "qwe12345",
      "id": 2
    },
    {
      "fullname": "eric dominguez",
      "email": "eric20@gmail.com",
      "username": "eric2020",
      "password": "qwe12345",
      "id": 3
    },
    {
      "fullname": "gustavo suarez",
      "email": "gustavo2020@gmail.com",
      "username": "gustavo2023",
      "password": "12345qwe",
      "id": 4
    },
    {
      "fullname": "guillermo benitez",
      "email": "guille2020@gmail.com",
      "username": "guille2020",
      "password": "12345",
      "id": 5
    }
  ],
  "profile": {
    "name": "typicode"
  },
  "producto": [
    {
      "name": "Lentes de Sol",
      "description": "Anteojo de sol Gaal 1004 ngm g15 Color del cristal Negro Estilo Rectangular Genero Unisex Color Negro",
      "category": "Lentes de sol",
      "id": 1,
      "price": 12000,
      "identifier": "Anteojo de sol Gaal 1004 ngm g15",
      "Stock": "Disponible",
      "img": "../../assets/img/lente de sol.jpg",
      "qty": 1
    },
    {
      "name": "Lentes Blue Filter",
      "description": "Anteojo Blue Filter Gaal 2004 tr bf14 Color del cristal Transparente Estilo Redondo Genero Unisex Color Dorado opaco",
      "category": "Lentes Blue Filter",
      "id": 1,
      "price": 15000,
      "identifier": "Anteojo Blue Filter Gaal 2004 tr bf14",
      "Stock": "Disponible",
      "img": "../../assets/img/lentes bluefilter.jpg",
      "qty": 1
    },
    {
      "name": "Gafas de Natación",
      "description": "Proporcionan una buena visibilidad a través del agua, son tu mejor elección si nadas por ocio y para mantenerte en forma, especialmente si no tienes costumbre de usar Gafas de Natación. ",
      "category": "Deporte",
      "id": 3,
      "price": 54000,
      "identifier": "Gafa sport Gaal 5000 tr kl80 Color de cristal Transparente y Resistente",   
      "Stock": "Disponible",
      "img": "../../assets/img/gafas natacion.jpg",
      "qty": 1
    },
    {
      "name": "Lentes de Lejos",
      "description": "La exclusiva marca Betania llega con esta colección de anteojos recetados hechos en Orgánico/Plástico que cuenta con un diseño cómodo y moderno, ideal para usar con tu receta de anteojos. Al ofrecer protección UV400, las gafas bloquean casi toda la exposición a los rayos UVA y UVB. Esto no sólo protege su visión, sino que también protege la piel alrededor de los ojos del sol. Corrigen los problemas de visión y le devuelven una visión nítida. (No son lentes polarizadas).",
      "category": "Recetados",
      "id": 4,
      "price": 25000,
      "identifier": "Marca Betania Modelo 8837C1 Unisex Material Vidrio Orgánico Armazón Plástico Forma Rectangular",
      "Stock": "Disponible",
      "img": "../../assets/img/lentes de lejos.jpg",
      "qty": 1
    },
    {
      "name": "Lentes de cerca",
      "description": "La exclusiva marca Betania llega con esta colección de anteojos recetados hechos en METAL-ACETATO que cuenta con un diseño cómodo y moderno, ideal para usar con tu receta de anteojos. Este diseño brinda confort y sirve para lucir siempre sofisticado/a. Su estilo particular se ajusta a tu rostro brindándote una apariencia renovada y única, como solo Betania puede darte.",
      "category": "Recetados",
      "id": 5,
      "price": 22000,
      "identifier": "Marca Betania Modelo 8837C13 Unisex Material Vidrio Acetato Armazón Metálico Forma Rectangular",
      "Stock": "Disponible",
      "img": "../../assets/img/lentes de cerca.jpg",
      "qty": 1
    },
    {
      "name": "Lentes para Niño",
      "description": "Anteojo Marca Betania, estos armazones están realizados con un material noble, hipoalergénico e irrompible, y por su diseño ergonométrico se adaptan totalmente a la fisonomía del rostro. Colores Varios",
      "category": "Recetados",
      "id": 6,
      "price": 15000,
      "identifier": "Marca Betania Modelo 845C3 Para Niños Unisex Material Vidrio Acetato Armazón Plástico Hipoalergénico Forma Rectangular",
      "Stock": "Disponible",
      "img": "../../assets/img/lentes de niño.jpg",
      "qty": 1
    },
    {
      "name": "Lentes Multifocal",
      "description": "Las lentes multifocales o también llamadas progresivas tienen más de una graduación y corrigen la vista en todas las distancias, para que no tengas que estar cambiando de anteojos. Son comúnmente utilizadas por personas que tienen Presbicia. Alrededor de los 40 años es normal que te cueste ver bien de cerca, por ejemplo si estas haciendo zoom para leer mejor desde tu celular o estirando el brazo para ver con nitidez es probable que estes comenzando con la Presbicia.",
      "category": "Recetados",
      "id": 7,
      "price": 30000,
      "identifier": "Marca Estilo Retro Vintage Modelo Multifocales en Policarbonato Unisex Material Metal Forma Cuadrada",
      "Stock": "Disponible",
      "img": "../../assets/img/lentes multifocal.jpg",
      "qty": 1
    },
    {
      "name": "Gafas Deportivas con/sin Graduación",
      "description": "Estas gafas cuentan con filtro polarizado. Reducen sensiblemente el reflejo en superficies como pavimento, autos, agua o nieve. Por lo tanto, son muy recomendables para practicar deportes (running, ciclismo, pesca, golf) o para conducir en la ruta. Reducen la fatiga visual y son muy recomendables para personas con alta sensibilidad a la luz o fotofobia.",
      "category": "Deporte",
      "id": 8,
      "price": 32000,
      "identifier": "Marca Go Modelo PLK Certificación: CE - Estampillado Marco: TR90 Material lentes: Policarbonato Proteccion: UV400 (protección UV-A y UV-B) Peso: 30grs aprox.",
      "Stock": "Disponible",
      "img": "../../assets/img/gafas deportivas.jpg",
      "qty": 1
    },
    {
      "name": "Gafas de Protección",
      "description": "Las gafas de seguridad son equipos de protección individual que sirven para proteger los ojos y la parte circundante en determinadas situaciones de riesgo. Es obligatorio usar gafas de seguridad cuando existe riesgo de que se proyecten objetos o líquidos que pueden provocar daños a la vista. Nuestros Modelos cuentan con Tecnología patentada de difusión de presión en las patillas, que permite que el lente se autoajuste a varios tipos de caras humanas. El recubrimiento anti-empañante Scotchgard™ dura más que cualquier recubrimiento anti-empañante tradicional, ayudando a mejorar el desempeño de los lentes en ambientes húmedos y con vapor.",
      "category": "Protección",
      "id": 9,
      "price": 42800,
      "identifier": "Marca 3M Modelo SecureFit 37510 AS OTG TRANSPARENTE Material:Policarbonato  Tipo de protección:Frontal  Tipo de tratamiento del cristal:ANTIRAYAS",
      "Stock": "Disponible",
      "img": "../../assets/img/gafas de proteccion.jpg",
      "qty": 1
    }
  ]
}